In [2]:
import os
import pandas as pd
import numpy as np

In [3]:
os.chdir('D:\Material\Online Class\Machine Learning\Session 44 - Project')

In [4]:
dataset = pd.read_csv("house_prices.csv")

In [7]:
dataset.head()

,area_type,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [8]:
dataset.shape

(13320, 8)

In [9]:
#Drop features that are not required to build our model

In [10]:
dataset2 = dataset.drop(['area_type','society','balcony'],axis='columns')

In [11]:
dataset2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [12]:
dataset2.shape

(13320, 5)

In [13]:
dataset2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [14]:
dataset3 = dataset2.dropna()

In [15]:
dataset3.shape

(13246, 5)

In [16]:
dataset3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [17]:
dataset3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [18]:
dataset3['bhk'] = dataset3['size'].apply(lambda x: int(x.split(' ')[0]))

D:\anaconda1\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [21]:
dataset3.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [22]:
dataset3['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [23]:
dataset3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [24]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [27]:
dataset3[~dataset3['total_sqft'].apply(is_float)].head()

               location   size   total_sqft  bath    price  bhk
30            Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122              Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165            Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188            KR Puram  2 BHK  1015 - 1540   2.0   56.800    2

In [28]:
def convert_sqft_to_num(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [29]:
convert_sqft_to_num('101')

101.0

In [30]:
convert_sqft_to_num('100-120')

110.0

In [31]:
print(convert_sqft_to_num('101meter'))

None

In [32]:
dataset4 = dataset3.copy()

In [33]:
dataset4.total_sqft = dataset4.total_sqft.apply(convert_sqft_to_num)

In [35]:
dataset4.total_sqft.isna().sum()

46

In [36]:
dataset4 = dataset4[dataset4.total_sqft.notnull()]

In [37]:
dataset4.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [39]:
dataset5 = dataset4.copy()

In [40]:
dataset5['price_per_sqft'] = dataset5['price']*100000/dataset5['total_sqft']

In [41]:
dataset5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [43]:
dataset5[dataset5.total_sqft/dataset5.bhk<300].head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
9,Gandhi Bazar,6 Bedroom,1020.0,6.0,370.0,6,36274.509804
45,HSR Layout,8 Bedroom,600.0,9.0,200.0,8,33333.333333
58,Murugeshpalya,6 Bedroom,1407.0,4.0,150.0,6,10660.980810
68,Devarachikkanahalli,8 Bedroom,1350.0,7.0,85.0,8,6296.296296
70,Double Road,3 Bedroom,500.0,3.0,100.0,3,20000.000000

In [44]:
dataset5.shape

(13200, 7)

In [45]:
dataset6 = dataset5[~(dataset5.total_sqft/dataset5.bhk<300)]

In [46]:
dataset6.shape

(12456, 7)

In [47]:
dataset6.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [48]:
def pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
dataset7 = pps_outliers(dataset6)

In [50]:
dataset7.price_per_sqft.describe()

count     9259.000000
mean      5724.719392
std       2536.208468
min       1250.000000
25%       4258.586679
50%       5185.185185
75%       6404.413665
max      35000.000000
Name: price_per_sqft, dtype: float64

In [51]:
dataset7.shape

(9259, 7)

In [38]:
#it is unusual to have 2 more bathrooms than number of bedrooms in a home

In [52]:
dataset7[dataset7.bath>dataset7.bhk+2]

,location,size,total_sqft,bath,price,bhk,price_per_sqft
779,BTM 1st Stage,9 Bedroom,3300.0,14.0,500.0,9,15151.515152
1972,Chikkabanavar,4 Bedroom,2460.0,7.0,80.0,4,3252.032520
6115,Nagasandra,4 Bedroom,7000.0,8.0,450.0,4,6428.571429
7429,Sathya Sai Layout,6 BHK,11338.0,9.0,1000.0,6,8819.897689
7908,Thanisandra,3 BHK,1806.0,6.0,116.0,3,6423.034330

In [53]:
dataset8 = dataset7.drop(['size','price_per_sqft'],axis='columns')

In [54]:
dataset8.head()

               location  total_sqft  bath  price  bhk
0   Devarabeesana Halli      1672.0   3.0  150.0    3
1   Devarabeesana Halli      1750.0   3.0  149.0    3
2   Devarabeesana Halli      1750.0   3.0  150.0    3
3   Devarachikkanahalli      1250.0   2.0   44.0    3
4   Devarachikkanahalli      1250.0   2.0   40.0    2

In [55]:
len(dataset8.location.unique())

765

In [56]:
dataset8.location = dataset8.location.apply(lambda x: x.strip())

In [57]:
location_stats = dataset8['location'].value_counts(ascending=False)

In [58]:
location_stats.head(10)

Whitefield               478
Sarjapur  Road           296
Electronic City          278
Kanakpura Road           190
Yelahanka                169
Uttarahalli              167
Raja Rajeshwari Nagar    164
Thanisandra              151
Marathahalli             149
Bannerghatta Road        145
Name: location, dtype: int64

In [59]:
len(location_stats[location_stats<=10])

581

In [60]:
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

Sarakki Nagar               10
Dasanapura                  10
Rajiv Nagar                 10
Banashankari Stage VI       10
Yelenahalli                 10
                            ..
Sri Balaji Krupa Layout      1
Veer Sandra                  1
Narayana Nagar 1st Block     1
Green Woods Layout           1
Versova Layout               1
Name: location, Length: 581, dtype: int64

In [61]:
len(dataset8.location.unique())

761

In [62]:
dataset8.location = dataset8.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)

In [63]:
len(dataset8.location.unique())

181

In [64]:
dummies = pd.get_dummies(dataset8.location)
dummies.head(3)

,1st Phase JP Nagar,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,Abbigere,Akshaya Nagar,Ambalipura,Ambedkar Nagar,...,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yeshwanthpur,other
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [65]:
dataset9 = pd.concat([dataset8,dummies.drop('other',axis='columns')],axis='columns')

In [66]:
dataset9.head()

,location,total_sqft,bath,price,bhk,1st Phase JP Nagar,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yeshwanthpur
0,other,1672.0,3.0,150.0,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,other,1750.0,3.0,149.0,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,other,1750.0,3.0,150.0,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,Devarachikkanahalli,1250.0,2.0,44.0,3,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,Devarachikkanahalli,1250.0,2.0,40.0,2,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [67]:
dataset10 = dataset9.drop('location',axis='columns')

In [68]:
dataset10.head(2)

,total_sqft,bath,price,bhk,1st Phase JP Nagar,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yeshwanthpur
0,1672.0,3.0,150.0,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1750.0,3.0,149.0,3,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [69]:
dataset10.shape

(9259, 184)

In [70]:
x = dataset10.drop(['price'],axis='columns')

In [71]:
x.head()

,total_sqft,bath,bhk,1st Phase JP Nagar,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,Abbigere,...,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelachenahalli,Yelahanka,Yelahanka New Town,Yeshwanthpur
0,1672.0,3.0,3,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1750.0,3.0,3,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1750.0,3.0,3,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1250.0,2.0,3,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1250.0,2.0,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [72]:
y = dataset10[['price']]

In [73]:
y.head()

   price
0  150.0
1  149.0
2  150.0
3   44.0
4   40.0

In [120]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [121]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
lr.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [122]:
y_pred=lr.predict(x_test)

In [123]:
from sklearn.metrics import r2_score
r2_score(y_test, y_pred)

0.7895583114132255

In [124]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score
cv = ShuffleSplit(n_splits=5, test_size=0.2)
cross_val_score(LinearRegression(), x, y, cv=cv)

array([0.73873036, 0.6400989 , 0.6282439 , 0.62403816, 0.73709687])

In [125]:
import pickle
f = open('home_prices_model.pickle','wb')
pickle.dump(lr,f)

In [126]:
import json
columns = {
    'data_columns' : [col.lower() for col in x.columns]
}
f = open("columns.json","w")
f.write(json.dumps(columns))

2974